app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "おはよう"], ["content", "こんにちは"], ["created_at", "2021-05-24 05:40:02.863414"], ["updated_at", "2021-05-24 05:40:02.863414"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "1"], ["updated_at", "2021-05-25 04:18:39.829905"], ["id", 3]]